Revit 2027 API
WallKind Enumeration
 Describes the fundamental type of wall, such as curtain wall or stacked wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WallKind
Public Enumeration WallKind
public enum class WallKind
type WallKind
Members
Member name | Value | Description
Basic | 0 |  A standard wall.
Curtain | 1 |  A curtain wall.
Stacked | 2 |  A stacked wall of several wall types.
Unknown | -1 |  The basic type is not known.
See Also
Reference
Autodesk.Revit.DB Namespace